In [1]:
df = read.table('Chapter9/Du_lieu/Table0.txt')

In [2]:
df

  V1       V2 V3  V4 V5
1 Alex     25 177 57 F
2 Lilly    31 163 69 F
3 Mark     23 190 83 M
4 Oliver   52 179 75 M
5 Martha   76 163 70 F
6 Lucas    49 183 83 M
7 Caroline 26 164 53 F

In [3]:
colnames(df) = c('Name', 'Age', 'Height', 'Weight', 'Sex')

In [4]:
df

  Name     Age Height Weight Sex
1 Alex     25  177    57     F
2 Lilly    31  163    69     F
3 Mark     23  190    83     M
4 Oliver   52  179    75     M
5 Martha   76  163    70     F
6 Lucas    49  183    83     M
7 Caroline 26  164    53     F

In [6]:
row.names(df) = df$Name

In [10]:
df$Name = NULL

In [11]:
df

         Age Height Weight Sex
Alex     25  177    57     F
Lilly    31  163    69     F
Mark     23  190    83     M
Oliver   52  179    75     M
Martha   76  163    70     F
Lucas    49  183    83     M
Caroline 26  164    53     F

In [12]:
write.table(df, file = 'Chapter9/Du_lieu/Table0_new.txt', sep = '\t')